FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/О2_QR_СтатусыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>О2_QR_СтатусыОплаты</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.О2_QR_СтатусыОплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекНаОплату</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОснованиеДокументаОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/CommonForms/О2_QR_ФормаОплаты/Ext/Form/Module.bsl
&НаСервере
Процедура ОтменаОплатыНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОтменаОплаты(Команда)
	ОтменаОплатыНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ОбновитьОстатокТаймаута",1,Ложь);
	ПодключитьОбработчикОжидания("ПроверитьСтатус",1,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСсылкуВБраузере(Команда)
	ЗапуститьПриложение(СсылкаНаОплату);
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьОстатокТаймаута() Экспорт 
	Если ОставшеесяВремя > 0 Тогда
		ОставшеесяВремя = ОставшеесяВремя - 1;
		Минуты = ОставшеесяВремя/60;
		Если Минуты > 1 Тогда
			Секунды = ОставшеесяВремя - (Цел(Минуты)*60);
			Минуты = Цел(Минуты);
		Иначе
			Секунды = ОставшеесяВремя;
			Минуты = 0;
		КонецЕсли;
		
		Если Минуты <> 0 Тогда
			Если Секунды <> 0 Тогда
				ОставшеесяВремяТекст = Строка(Минуты) + " мин. " + Строка(Секунды) + " сек.";
			Иначе
				ОставшеесяВремяТекст = Строка(Минуты) + " мин.";
			КонецЕсли;
		Иначе
			ОставшеесяВремяТекст = Строка(Секунды) + " сек.";
		КонецЕсли;
		
	Иначе
		ОтключитьОбработчикОжидания("ОбновитьОстатокТаймаута");
		ОставшеесяВремяТекст = "Время оплаты вышло!";
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ПроверитьСтатусНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	О2_QR_СтатусыОплатыСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.О2_QR_СтатусыОплаты.СрезПоследних(, ИдПлатежа = &ИдПлатежа) КАК О2_QR_СтатусыОплатыСрезПоследних";
	
	Запрос.УстановитьПараметр("ИдПлатежа", IDОплаты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекущийСтатусПлатежа = ПолучитьКомментарийПеречисления(ВыборкаДетальныеЗаписи.Статус);
		ТекущийСтатусПлатежаПеречисление = ВыборкаДетальныеЗаписи.Статус;
	КонецЦикла;
	
КонецПроцедуры
&НаСервере
Функция ПолучитьКомментарийПеречисления(ЗначениеПеречисления) Экспорт
	ИмяПеречисления = ЗначениеПеречисления.Метаданные().Имя;
	ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);
	КомментарийЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Комментарий;
	Возврат КомментарийЗначенияПеречисления;
Конецфункции

&НаКлиенте
Процедура ПроверитьСтатус()
	ПроверитьСтатусНаСервере();
	Если ТекущийСтатусПлатежаПеречисление = "Fiscalized" Тогда
		Сообщить("Оплата завершена!");
		// Закоментировали потому что на сервере это не доступно, нужно проверить модуль документа ЗН на клиент-серверный вызов
		
		//Если ОплачиваемыйДокумент.ТипСпособаРасчетаККТ = Перечисления.ТипыСпособаРасчетаККТ.Передача Тогда
		//	ЗакрытьЗаказНаряд(ОплачиваемыйДокумент.ДокументОснование);
		//КонецЕсли;
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ЗакрытьЗаказНаряд(СсылкаЗаказНаряд)
	
	Если ТипЗнч(СсылкаЗаказНаряд) = Тип("ДокументСсылка.ЗаказНаряд") И 
		СсылкаЗаказНаряд.состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
		
		ОбДокумент = СсылкаЗаказНаряд.ПолучитьОбъект();
		ОбДокумент.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт;
		Попытка
			ОбДокумент.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			ТекстОшибки = "Переведен статус заказ-наряда <"+СсылкаЗаказНаряд.Ссылка+"> В состояние <Закрыт>";
			Сообщить(ТекстОшибки);
		Исключение
			ТекстОшибки1с = ОписаниеОшибки();
			ТекстОшибки = "Ошибка изменения статуса заказ-наряда <"+СсылкаЗаказНаряд.Ссылка+"> В состояние <Закрыт> - "+ ТекстОшибки1с;
			Сообщить(ТекстОшибки);
		КонецПопытки;
	КонецЕсли; 
	
КонецПроцедуры
